const n=`---
title: 不工作學畫畫，3 年的美術人生
date: 2025-10-07
id: personal0003
tag: personal, art
toc: true
---

<style>
  video {
    border-radius: 4px;
  }
  img {
    max-width: 660px;
  }
</style>

### 2015 年 11 月開始的

#### 除了數學還有甚麼？

首先是一些蠻沉悶的背景資料。2014 年 8 月從 HKUST 研究所畢業，主修數學，而且是純粹數學，研究有界解析函數（啥？）。

從 2014 年 9 月 開始直到 2015 年 10 月我都在幹研究助理這工作，期間換了兩間學校 (轉學校換題目)。2015 年 10 月以前開始思考接下來要做甚麼工作。

回顧一下自己， 中學最後兩年開始對數學有興趣，三年本科念數學，二年研究所念數學，一年零一個月工作還是數學，也就是我對同一門學問長達八年之久。

我未來到底想幹甚麼？

如果是數學相關的話，向上看最理想就是繼續讀 4 至 5 年博士，運氣好就可以找到 2, 3 年 博士後的工作，然後運氣更好的話可以到一間學校做助理教授，運氣再再再好一點的話 6 年內可以從助理教授晉升到終身教職。也就是說 (有機會) 走這條路的話，保守估計安定的生活能夠從
$$
5 + 3 + 6 = 14
$$
年後得到，但離開學術界的話這 14 年肯定白過。

這風險大得離譜...，向下看的話，努力繼續用只到中學程度 (不包括競賽數學) 的數學知識來維生也可以的。可是做 10 年, 20 年這種非研究型的工作，數學知識基本上不會有任何增長，回頭看自己肯定沒任何長進。


經過這些思考，我決定不再碰數學。


沒有數學，除了左右手我還有甚麼？我中學時期還練就了一門手藝 ... 畫畫。工作了一年也儲了一些錢，學費也還清，乾脆這一年都專心培養這門興趣 ... 吧 ......。


#### 重握畫筆

中學畢業 6 年後的我拿筆去畫，就只能畫出這種東⻄︰

[![](/assets/img/2025-10-08-15-44-57.png)](/assets/img/2025-10-08-15-44-57.png)

當時的我還覺得蠻好看的。把它掃進電腦，描線稿，用 SAI 上色，兩個星期後終於完成了！

[![](/assets/img/2025-10-08-15-45-32.png)](/assets/img/2025-10-08-15-45-32.png)

這是我那時花最大力氣能畫出的成果。就這樣我開始用這種純日式的方式畫了幾張差不多的東⻄︰

[![](/assets/img/2025-10-08-15-45-48.png)](/assets/img/2025-10-08-15-45-48.png)

速度是 3 星期到一個月一張... (現在回想花那麼多時間去磨... 未必是正確，嘛也不確定這是否新手的必經的階段...)。

因為感覺總是孤軍作戰的，所以我開始想找一群志同道合的人，希望能夠一起討論。但是現在已經不如 10 年前那麼流行 "論壇"，在 FB 也是滿滿的繪圖圈不知道如何認識其他人。有看到一些 FB 帳號可以有上千到數千個 "朋友" 的，開始找到繪圖圈怎樣認識人的一些端倪...。

但是亂加友肯定有一群不太想關注的 "朋友" 在裏面，感覺花時間去箍選哪些人優先看很麻煩，更不想因此令我錯過我想看的內容，所以直到現在我 FB 還是沒有跟 沒有任何交集的 人加 "朋友"。

### 發現 twitch 不單實況打遊戲 

以前已經有看實況打遊戲的習慣。 在 12  月初有了找繪友的想法後，我意識到有人會實況畫圖才對，忘了是哪些關鍵詞把我導進 Twitch \`CREATIVE\` 這個 category。 第一個跑進去看的台就是同是香港人的 hynnchan 的台，也認識到其他喜歡畫圖的香港人，最後忘記是誰推薦我到 "[路得](https://www.twitch.tv/mg470)" 台（台灣的），因為氣氛很好又很常開台，我在那邊逗留了差不多 3 個月 （台主有開麥講話不太悶）。


### 2016 年各月份的轉變

以下開始會比較明確用月份來分隔每一個時段。

#### 2015 年 12 月初 - 2016 年 2 月底

從路得台中第一次看到原來畫圖可以不太理會線稿，漸變可以靠不斷吸眼色去 "磨" 出來，也就是第一次認識到厚塗這種東西。這對我來說是很大的思想衝擊 ...。因為 twitch 呆久了，有機會看到其他大大的台，如 aoin（阿歐印），gtuner（鬼鬼）等。眼界進一步大開：

> 為甚麼可以幾乎所有步驟都在一個圖層上做 ... ；
為甚麼線條可以那麼漂亮 ...。

因為我認識的畫家不多，他們給了我第一個看得到卻攀不上的高度。

我也是這個月份討論得比較多，才知道 krenz (k 大)，無多，大飛老師，駿恆老師，等等等等的大師。12 月底才知道駿恆老師還辦網絡課，但是 4T 報名在我知道時已經截止，所以這幾個月都是靠星期天的實況畫作點評來了解一下教學內容。其中還聽到同是香港的宦伯的訪談 ...。「原來還是有香港的同學喔！」這樣的想法和各種心情就令我決定報一下駿恆老師 5T 的課了。

（那時感覺自己用 photoshop 畫圖根本不可能啊 ....，最後發現只要筆刷足夠，加一個 coolorus 就可以了。）

#### 2016 年 3 月初 - 3 月底

這是一個很微妙的時期，我突然很想像 aoin 那樣畫畫看，甚麼都在同一個圖層做，就這樣我玩 painter 2015 有大概 2 個月的時間（我上駿恆老師課頭一個月還是在用 painter ...）。

以下是那時段的一些完稿︰

[![](/assets/img/2025-10-08-15-48-48.png)](/assets/img/2025-10-08-15-48-48.png)

[![](/assets/img/2025-10-08-15-48-57.png)](/assets/img/2025-10-08-15-48-57.png)

[![](/assets/img/2025-10-08-15-49-05.png)](/assets/img/2025-10-08-15-49-05.png)

不過熟悉 photoshop 後我也是回不去 painter (汗。也深深了解這種一圖層流的弊處，所以再也沒有這樣畫了。

還有因為學習 painter 令我不得不學習三角形調色盤的原理：

<customimage src="/assets/img/2025-10-08-15-49-26.png" width="240"></customimage>

了解之後我再也沒有用過 4 方形的調色盤了。還有很多很多 photoshop 的筆刷我也是仿照 painter 造出來的，像 painter 的 平滑墨水筆 ... 基本圓刷 (但不能混色)，可塑向量筆...，小型輕柔噴槍 ....。另外 painter 噴槍的顆粒特性也使它跟大部分其他軟件的噴槍不一樣，但在 photoshop 還是有有心人做到了。

總的來說我覺得學習 painter 還是值的，雖然時間很短暫。

#### 2016 年 4 月初 - 6 月底

5T 緊湊的課程 ...，很久沒有上課，有點興奮 （M 屬性發作）。

[![](/assets/img/2025-10-08-15-50-32.png)](/assets/img/2025-10-08-15-50-32.png)

駿恆老師的課是每一個星期兩天，每天晚上 7 點到 11 點。所以剛開始還好，之後上課感到愈來愈累 ...。 每一個梯次會有各自的 line 群， QQ 群，還有 G+ 房。我參加的梯次還有很多人現在還活躍在 G+ 房練功 .............

[![](/assets/img/2025-10-08-15-50-50.png)](/assets/img/2025-10-08-15-50-50.png)

還會被罵和深入討論 ...，下面是 7 月份的

[![](/assets/img/2025-10-08-15-51-01.png)](/assets/img/2025-10-08-15-51-01.png)

[![](/assets/img/2025-10-08-15-51-06.png)](/assets/img/2025-10-08-15-51-06.png)

還記得 4 月份已經有人跟我講要留意虛實，可是我都一直在犯同樣的錯，很感激這位會罵我的基友。龍族數位同學構成了我繪友的主要部分，有了這一群認真的同學我才不會止步不前。

現在回頭看這段時期的完稿都 ... 不太理想。



<customimage src="/assets/img/2025-10-08-15-51-37.png" width="500"></customimage>
<customimage src="/assets/img/2025-10-08-15-51-43.png" width="500"></customimage>
<customimage src="/assets/img/2025-10-08-15-51-48.png" width="500"></customimage>
<customimage src="/assets/img/2025-10-08-15-51-54.png" width="500"></customimage>

還記得 5 月開始所有作品都在 photoshop 上面畫了，painter 就這個月份開始被丟進冷宮（可是我偶爾還是會開來把玩一下）。


#### 2016 年 7 月初 - 11 月底 (剛滿一年)

開始練石膏，那時我也不曉得練來幹嘛，只是想試試看會有甚麼收穫。畫之前我已經被吩咐不能用描的，我都是很小心不停比對去畫，沒有任何點線概念。

[![](/assets/img/2025-10-08-15-52-19.png)](/assets/img/2025-10-08-15-52-19.png)

[![](/assets/img/2025-10-08-15-52-26.png)](/assets/img/2025-10-08-15-52-26.png)

[![](/assets/img/2025-10-08-15-52-31.png)](/assets/img/2025-10-08-15-52-31.png)

嗯就這幾張，之後都沒再畫了。

8 月開始決心每一張圖都要完完整整的，所以開始考慮背景和整體的光影構圖，還有堅持每隔一段時間要訓練冷光。

[![](/assets/img/2025-10-08-15-53-05.png)](/assets/img/2025-10-08-15-53-05.png)



[![](/assets/img/2025-10-08-15-53-10.png)](/assets/img/2025-10-08-15-53-10.png)

蕾姆不是畫得很滿意，12 月份的 drawcrowd 比賽會再重畫一張。

9 月開始留意到自己喜歡在臉部加細節，以前那種比較卡通的日式畫法畫個眼袋也覺得不自然 ...。所以開始參考比較韓日式的畫家，自己開始慢慢改變：

[![](/assets/img/2025-10-08-15-53-29.png)](/assets/img/2025-10-08-15-53-29.png)

[![](/assets/img/2025-10-08-15-53-36.png)](/assets/img/2025-10-08-15-53-36.png)

10 月開始回頭再接觸黑白的東西。我報了大飛老師的光影課，很久沒碰石膏...，畫了一顆課前作業：

[![](/assets/img/2025-10-08-15-53-54.png)](/assets/img/2025-10-08-15-53-54.png)

嗯... 沒有再碰反而有進步了的感覺 ...。 嘛因為我作業都畫得很渣所以都不放出來了XD。需然我石膏畫不好，但我覺得我還是有慢慢把學到的應用在自己的創作上 ... （不敢說得太明確 orz）。

上課期間我還是有堅持畫自己的爽圖：

[![](/assets/img/2025-10-08-15-54-08.png)](/assets/img/2025-10-08-15-54-08.png)

自己有嘗試進一步去學習顏色。皮膚暗部我特意嘗試很鮮的紅色，利用紅色飽和度愈高，明度愈低的特性來控制明暗，感覺這張的臉部有成功做到這一點（因為暖光打在臉上所以成為了顏色鮮一點的合理性）。話說這張圖最大的收穫是學習液體的畫法，這超實用（誒?。

上面那張圖完成之後有幾張不理想的失敗作，期間大飛老師的第 7 堂作業是畫爽圖，所以我也放下手頭上的圖來畫這個作業。我也驚訝平常畫圖要兩個禮拜去完成的自己可以在一個禮拜畫完 ...：

[![](/assets/img/2025-10-08-15-54-21.png)](/assets/img/2025-10-08-15-54-21.png)

整張圖都是用色塊去起稿的（骨架，衣服，頭髮，尾巴，等等等等），可是這是二創，希望在未來我能夠直接用色塊去做設計。感覺自己有把目前所學的應用在裏面。

大飛老師的課題成為了我 11 月最好的禮物！


### 2017 年



#### 奇怪的合作機會


在求職其間偶然地遇到奇怪的合作，例如︰

- [Hilton Yuen](https://www.hiltonyuen.com/) 的桌遊，但我忘記名子了。
- [Oice 視角小說 (可先關掉聲音)](https://oice.com/story/8237eaf90ee94ba68e113aa2449a4704)

    <customimage src="/assets/img/2025-10-08-22-20-28.png" width="500"></customimage>

#### 投履歷，CV.pdf

每月都在追求進步，只是還沒到可以找到工作的地步。那時後已經開始對各遊戲公司投履歷，基本上都沒有回音。我都開始懷疑是我能力問題還是沒有 connection 的問題了。

那時基本上都是投這個用 [InDesign 製作的 PDF](/assets/portfolios/pdfs/ArtPortfolio.pdf)。

#### 2017 年底，到大陸發展

我也忘記甚麼原因跟一個本地獨立遊戲勾搭上了。當時跟遊戲 [龍之氣息](https://play.google.com/store/apps/details?id=com.Company.BreathofDragons&hl=zh_HK) 的作者合作。

<Example>

**題外話.** 我也沒想到到了 2024 年我以前的插圖依然活躍在遊戲中 ...

[![](/assets/img/2025-10-08-22-32-09.png)](/assets/img/2025-10-08-22-32-09.png)

</Example>


還記得當時薪金說好是 $x$ 港幣，成團後 (集齊其他美術，策劃，等等) 我的薪金直接砍成 $\\frac{1}{3}x$ 人民幣。

因為要往內地發展，這個 $\\frac{1}{3}x$ 其實是深圳當時的平均薪金。應該是"老闆"當時也不清楚深圳的巿價。也擺了，反正缺的是經驗，做美術也不求溫飽，忍着微薄的薪金幹下去，祈求未來能打出一個新天地 (最後當然是不行)。

整個團隊最後移居深圳龍岡當黑奴。

### 2018 年 1 月 - 2018 年 12 月初，正式結束美術夢

渾沌的美術生活，充實 (爆肝) 卻不寫意，就不着墨了。等我回憶突然回來可能寫另外一篇曰記講講這一年發生了甚麼。說實話不太願意回憶起來。

往後的生涯規劃也跟美術沾不上邊了。如同你到這個人網頁所見，變成了一隻小碼農。`;export{n as default};
