const n=`---
title: "被拉進 Bootcamp Training，職涯的改寫"
date: 2026-04-20
id: personal0009
tag: personal
intro: 回顧 bootcamp training
indent: false
toc: true
img: /assets/img/2026-04-20-02-30-33.png
scale: 1.1
offsetx: 0
offsety: -20
---


<style>
  video {
    border-radius: 4px;
    max-width: 660px;
  }
  img {
    max-width: 660px !important;
  }

  .label-container {
    border: none;
    stroke: none !important;
    fill : transparent !important;
  }
  .edgeLabel {
    padding: 10px;
    background-color : rgb(248, 249, 250) !important;
  }
</style>


### 2019 年後的職涯
#### 放棄畫師夢，失去方向
2018 年 12 月辭退在大陸的遊戲美術職位，2019 年 1 月嘗試過遊戲公司的 Project Manager (只維持了一個星期，詳見[那些年，短期內離職，不會寫到 CV 的工作](/blog/article/那些年-短期內離職-不會寫到-CV-的工作#2.1.-zoomob-limited-(2019-年,-project-manager,-1-星期)))，然後職涯上就失去方向了。

其實在我還在就讀 HKUST 研究院的時候，就有看過一個 facebook page: ***這個 PhD 只是我的負累***。作者以故事形式紀錄了自己數學博士生涯以及畢業後找工作的經歷 (其後被收錄成一本自傳，名為 《博士淪落人》)。他的故事帶給了我一些職涯上的啟發。

數學系學生能夠做甚麼？像我們有能力去理解極度抽像的數學結構，能應用到甚麼地方？雖然印像有點模糊，但我記得博士淪落人的作者最後成為了一個編寫網頁的 Programmer。我也曾想過，如果當時香港也有一個自己的 [米畫師](https://www.mihuashi.com/) 網站， 以我的畫功是不是在沒有 "人脈" 的情況下，也能夠找到一些簡單的繪圖工作糊口呢？如果香港沒有，我是不是也可以自己弄一個這樣的網頁？

可是當時我根本不知道如何入門去寫網頁。雖然當時資訊已經很發達了，但是從 0 到 1 依然是一個不容易的過程。

#### 2019 年被拉進 Bootcamp Training

那時候我爸看到報紙上有報導︰
1. Bootcamp Training 如何成功讓學員轉行成為程式設計師。
2. 巿場上對網頁程式設計師需求量大。
3. 大學的 Computer Science 課程恰恰沒有提供網頁程式設計師的訓練。這使到 Programmer 的門檻其實並不是一個 CS degree。相反，只有 CS degree 其實不符合 Web Programmer 的需求。
4. 有免費試堂。
5. 有免費試堂。
6. 有免費試堂。

就這樣，我就被拉到位於荃灣西的 Tecky Academy 教室，嘗試理解當代的網頁設計是怎麼一回事。那時候我甚至沒搞懂 \`function\` 內部的 \`return\` 是甚麼意思。

除了試堂外，Tecky Academy 還會為每一季的畢業生舉行作品展覧，邀請業界人仕參觀。努力而且成果較亮眼的學生甚至會收到公司的卡片 (雖然我不知道有沒有人會因此得到面試機會)。試堂加上參觀過展覽後，我們就決定交上 4 萬多港元的學費來參加下一期的 Bootcamp Traning 了。


### Bootcamp 課程

![](/assets/img/2026-04-19-12-30-13.png)

#### 課程的內容

課程內容截取自[官網](https://tecky.io/zh_Hant/courses/MAP/details/)。

他們幾年後在課程硬塞了很多內容，短短三個月根本學不完呢。


![](/assets/img/2026-04-20-03-23-55.png)

![](/assets/img/2026-04-20-03-24-32.png)

![](/assets/img/2026-04-20-03-24-56.png)

![](/assets/img/2026-04-20-03-25-15.png)


#### 沒有生成式 AI 時代下的上課模式

上課時間是上午 9 點到下午 6 點。

當然講師不可能在這一段時間講個不停。在早上，講師會講大概一個多小時的內容，包括一些概念，代碼範例等等。然後就會出一些題目，讓我們自己去探索怎樣解決。學生在早上，午餐休息過後到下午都在解題。直到下午 5 點講師會講解題目的答案。學生比對老師跟自己的答案從而消化課程所教的內容。

一開始大家下課都會回家吃晚飯，可是到後來為了要趕 Project (我們一季會有 3 個 Group Project)，大家都會在教室待到晚上 10 點左右才回家 (晚飯都在教室附近吃)。那種一起戰鬥的感覺使我們那團 "想轉行" 的火未曾消滅過。

<Example>

**題外話.** 與當今的 AI 學習法相比，現代人學習編程應該已經失去 "消化知識" 的耐性了。因為 AI 吐出的知識太多太快，現代學生久而久之失去了反覆思考的過程。 

個人認為學習任何 ***思考型*** 的知識 (例如數學題，物理題，非資料型的)，還是要強制把生成式 AI 關上。這好比以前做大學數學的證明題練習，你花了一整天的時間去想。無論最終想通了還是沒有想到答案，無論答案如何，你從探索答案的這條路上也會有很多額外的收獲。



</Example>

### 畢業
#### 作品展
![](/assets/img/2026-04-20-03-44-55.png)

經過 3 個多月，終於也輪到我們進行畢業展，展示我們的成果予觀眾及回答觀眾的提問。我們的應用當時使用了這些技術︰

- 前端︰
  - React.js
  - Redux
- 後端︰
  - Nodejs and Express Framework
  - PostgreSQL
  - EC2
  - ElasticSearch
  - Web3.js
  - Ethereum Blockchain Network (Test Net)

(啊，2019 年的共識︰js? 不存在的，必定都用 typescript) 

當時 2019 年香港發生了社運事件，而奇怪地，香港當時的氣氛是不允許任何人，任何團體 "沒有政治立場"。我們因此製造了一個頗為偏激的項目︰

> 建立一個網站把不同食店的 "想法" 紀錄到 blockchain，不讓任何人修改。而使用者可以經我們的網站查閱不同食肆經媒體報導過的政治立場。


#### 課程真的結束了

![](/assets/img/2026-04-20-03-59-51.png)

大概 7 成的學生都找到工作，其後的兩年還有約出來談談近況。之後有的移民，有的突然消失了似的，就沒有再約出來了。


而我畢業幾個月後找到第一份前端工作。工作第二年開始績極尋找更多後端開發的機會。中途因為對 AI 感到強烈興趣而轉換過軌道。可是憑自己的觸覺察覺到 AI 的發展不對勁，強行把賽道掰回全端開發。到第 7 個年頭了，有待過大公司，也有待過小公司。

#### AI 浪潮下的規劃

為了保持技術上的競爭力，往後都打算繼續待在小公司 / 初創，績極地在前線打拼，不假手於人。在 AI 浪潮下，當人人都在利用 AI 去做應用層面的開發，我選擇從應用層回歸學習最底層的知識。應用我寫得夠多了，可是以前從應用層思考過的問題，尤其是那些技術層面的黑盒子，我至今仍然沒有搞清楚裏面發生了甚麼。

利用 AI，我開始研究那些我自己沒有思考過的問題，造就了我 Tech Blog 中那套 Networking in Linux Kernel 系列文章。這系列我應該還會寫好一段時間，直到我心裏面的疑問都解開為止。

當 Networking 的疑問都掃清以後，就輪到 Database 底層了。知識深似海，有了 AI 後學習變得更快更方便了，但是知識的複雜性從來沒有因此變簡單過。我們還是需要讓它們在我們的腦海中不斷浸殿，翻覆思考，才能理解得更深入。

只有理解得足夠深入，才能問出正確的問題，這樣才能發揮 AI "萬事通" 的才能。所謂的造學問，**學**懂怎樣去**問**才是至關重要的技能！`;export{n as default};
